Service References/IranKishTokenWS/service1.wsdl

<?xml version="1.0" encoding="utf-8"?>
<wsdl:definitions xmlns:wsap="http://schemas.xmlsoap.org/ws/2004/08/addressing/policy" xmlns:wsa10="http://www.w3.org/2005/08/addressing" xmlns:tns="http://tempuri.org/" xmlns:msc="http://schemas.microsoft.com/ws/2005/12/wsdl/contract" xmlns:soapenc="http://schemas.xmlsoap.org/soap/encoding/" xmlns:wsx="http://schemas.xmlsoap.org/ws/2004/09/mex" xmlns:wsp="http://schemas.xmlsoap.org/ws/2004/09/policy" xmlns:wsam="http://www.w3.org/2007/05/addressing/metadata" xmlns:wsa="http://schemas.xmlsoap.org/ws/2004/08/addressing" xmlns:soap12="http://schemas.xmlsoap.org/wsdl/soap12/" xmlns:wsaw="http://www.w3.org/2006/05/addressing/wsdl" xmlns:soap="http://schemas.xmlsoap.org/wsdl/soap/" xmlns:wsu="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-utility-1.0.xsd" xmlns:xsd="http://www.w3.org/2001/XMLSchema" name="Service1" targetNamespace="http://tempuri.org/" xmlns:wsdl="http://schemas.xmlsoap.org/wsdl/">
  <wsdl:types>
    <xs:schema elementFormDefault="qualified" targetNamespace="http://tempuri.org/" xmlns:xs="http://www.w3.org/2001/XMLSchema">
      <xs:import namespace="http://schemas.datacontract.org/2004/07/Token" />
      <xs:element name="MakeToken">
        <xs:complexType>
          <xs:sequence>
            <xs:element minOccurs="0" name="amount" nillable="true" type="xs:string" />
            <xs:element minOccurs="0" name="merchantId" nillable="true" type="xs:string" />
            <xs:element minOccurs="0" name="invoiceNo" nillable="true" type="xs:string" />
            <xs:element minOccurs="0" name="paymentId" nillable="true" type="xs:string" />
            <xs:element minOccurs="0" name="specialPaymentId" nillable="true" type="xs:string" />
            <xs:element minOccurs="0" name="revertURL" nillable="true" type="xs:string" />
            <xs:element minOccurs="0" name="description" nillable="true" type="xs:string" />
          </xs:sequence>
        </xs:complexType>
      </xs:element>
      <xs:element name="MakeTokenResponse">
        <xs:complexType>
          <xs:sequence>
            <xs:element xmlns:q1="http://schemas.datacontract.org/2004/07/Token" minOccurs="0" name="MakeTokenResult" nillable="true" type="q1:tokenResponse" />
          </xs:sequence>
        </xs:complexType>
      </xs:element>
      <xs:element name="MakeSpecialToken">
        <xs:complexType>
          <xs:sequence>
            <xs:element minOccurs="0" name="amount" nillable="true" type="xs:string" />
            <xs:element minOccurs="0" name="merchantId" nillable="true" type="xs:string" />
            <xs:element minOccurs="0" name="invoiceNo" nillable="true" type="xs:string" />
            <xs:element minOccurs="0" name="paymentId" nillable="true" type="xs:string" />
            <xs:element minOccurs="0" name="specialPaymentId" nillable="true" type="xs:string" />
            <xs:element minOccurs="0" name="revertURL" nillable="true" type="xs:string" />
            <xs:element minOccurs="0" name="description" nillable="true" type="xs:string" />
            <xs:element minOccurs="0" name="extraParam1" nillable="true" type="xs:string" />
            <xs:element minOccurs="0" name="extraParam2" nillable="true" type="xs:string" />
            <xs:element minOccurs="0" name="extraParam3" nillable="true" type="xs:string" />
            <xs:element minOccurs="0" name="extraParam4" nillable="true" type="xs:string" />
          </xs:sequence>
        </xs:complexType>
      </xs:element>
      <xs:element name="MakeSpecialTokenResponse">
        <xs:complexType>
          <xs:sequence>
            <xs:element xmlns:q2="http://schemas.datacontract.org/2004/07/Token" minOccurs="0" name="MakeSpecialTokenResult" nillable="true" type="q2:tokenResponse" />
          </xs:sequence>
        </xs:complexType>
      </xs:element>
    </xs:schema>
    <xs:schema xmlns:tns="http://schemas.microsoft.com/2003/10/Serialization/" attributeFormDefault="qualified" elementFormDefault="qualified" targetNamespace="http://schemas.microsoft.com/2003/10/Serialization/" xmlns:xs="http://www.w3.org/2001/XMLSchema">
      <xs:element name="anyType" nillable="true" type="xs:anyType" />
      <xs:element name="anyURI" nillable="true" type="xs:anyURI" />
      <xs:element name="base64Binary" nillable="true" type="xs:base64Binary" />
      <xs:element name="boolean" nillable="true" type="xs:boolean" />
      <xs:element name="byte" nillable="true" type="xs:byte" />
      <xs:element name="dateTime" nillable="true" type="xs:dateTime" />
      <xs:element name="decimal" nillable="true" type="xs:decimal" />
      <xs:element name="double" nillable="true" type="xs:double" />
      <xs:element name="float" nillable="true" type="xs:float" />
      <xs:element name="int" nillable="true" type="xs:int" />
      <xs:element name="long" nillable="true" type="xs:long" />
      <xs:element name="QName" nillable="true" type="xs:QName" />
      <xs:element name="short" nillable="true" type="xs:short" />
      <xs:element name="string" nillable="true" type="xs:string" />
      <xs:element name="unsignedByte" nillable="true" type="xs:unsignedByte" />
      <xs:element name="unsignedInt" nillable="true" type="xs:unsignedInt" />
      <xs:element name="unsignedLong" nillable="true" type="xs:unsignedLong" />
      <xs:element name="unsignedShort" nillable="true" type="xs:unsignedShort" />
      <xs:element name="char" nillable="true" type="tns:char" />
      <xs:simpleType name="char">
        <xs:restriction base="xs:int" />
      </xs:simpleType>
      <xs:element name="duration" nillable="true" type="tns:duration" />
      <xs:simpleType name="duration">
        <xs:restriction base="xs:duration">
          <xs:pattern value="\-?P(\d*D)?(T(\d*H)?(\d*M)?(\d*(\.\d*)?S)?)?" />
          <xs:minInclusive value="-P10675199DT2H48M5.4775808S" />
          <xs:maxInclusive value="P10675199DT2H48M5.4775807S" />
        </xs:restriction>
      </xs:simpleType>
      <xs:element name="guid" nillable="true" type="tns:guid" />
      <xs:simpleType name="guid">
        <xs:restriction base="xs:string">
          <xs:pattern value="[\da-fA-F]{8}-[\da-fA-F]{4}-[\da-fA-F]{4}-[\da-fA-F]{4}-[\da-fA-F]{12}" />
        </xs:restriction>
      </xs:simpleType>
      <xs:attribute name="FactoryType" type="xs:QName" />
      <xs:attribute name="Id" type="xs:ID" />
      <xs:attribute name="Ref" type="xs:IDREF" />
    </xs:schema>
    <xs:schema xmlns:tns="http://schemas.datacontract.org/2004/07/Token" elementFormDefault="qualified" targetNamespace="http://schemas.datacontract.org/2004/07/Token" xmlns:xs="http://www.w3.org/2001/XMLSchema">
      <xs:complexType name="tokenResponse">
        <xs:sequence>
          <xs:element minOccurs="0" name="message" nillable="true" type="xs:string" />
          <xs:element minOccurs="0" name="result" type="xs:boolean" />
          <xs:element minOccurs="0" name="token" nillable="true" type="xs:string" />
        </xs:sequence>
      </xs:complexType>
      <xs:element name="tokenResponse" nillable="true" type="tns:tokenResponse" />
    </xs:schema>
  </wsdl:types>
  <wsdl:message name="ITokens_MakeToken_InputMessage">
    <wsdl:part name="parameters" element="tns:MakeToken" />
  </wsdl:message>
  <wsdl:message name="ITokens_MakeToken_OutputMessage">
    <wsdl:part name="parameters" element="tns:MakeTokenResponse" />
  </wsdl:message>
  <wsdl:message name="ITokens_MakeSpecialToken_InputMessage">
    <wsdl:part name="parameters" element="tns:MakeSpecialToken" />
  </wsdl:message>
  <wsdl:message name="ITokens_MakeSpecialToken_OutputMessage">
    <wsdl:part name="parameters" element="tns:MakeSpecialTokenResponse" />
  </wsdl:message>
  <wsdl:portType name="ITokens">
    <wsdl:operation name="MakeToken">
      <wsdl:input wsaw:Action="http://tempuri.org/ITokens/MakeToken" message="tns:ITokens_MakeToken_InputMessage" />
      <wsdl:output wsaw:Action="http://tempuri.org/ITokens/MakeTokenResponse" message="tns:ITokens_MakeToken_OutputMessage" />
    </wsdl:operation>
    <wsdl:operation name="MakeSpecialToken">
      <wsdl:input wsaw:Action="http://tempuri.org/ITokens/MakeSpecialToken" message="tns:ITokens_MakeSpecialToken_InputMessage" />
      <wsdl:output wsaw:Action="http://tempuri.org/ITokens/MakeSpecialTokenResponse" message="tns:ITokens_MakeSpecialToken_OutputMessage" />
    </wsdl:operation>
  </wsdl:portType>
  <wsdl:binding name="BasicHttpBinding_ITokens" type="tns:ITokens">
    <soap:binding transport="http://schemas.xmlsoap.org/soap/http" />
    <wsdl:operation name="MakeToken">
      <soap:operation soapAction="http://tempuri.org/ITokens/MakeToken" style="document" />
      <wsdl:input>
        <soap:body use="literal" />
      </wsdl:input>
      <wsdl:output>
        <soap:body use="literal" />
      </wsdl:output>
    </wsdl:operation>
    <wsdl:operation name="MakeSpecialToken">
      <soap:operation soapAction="http://tempuri.org/ITokens/MakeSpecialToken" style="document" />
      <wsdl:input>
        <soap:body use="literal" />
      </wsdl:input>
      <wsdl:output>
        <soap:body use="literal" />
      </wsdl:output>
    </wsdl:operation>
  </wsdl:binding>
  <wsdl:service name="Service1">
    <wsdl:port name="BasicHttpBinding_ITokens" binding="tns:BasicHttpBinding_ITokens">
      <soap:address location="https://ikc.shaparak.ir/TToken/Tokens.svc" />
    </wsdl:port>
  </wsdl:service>
</wsdl:definitions>