final_xml.html

<?xml version="1.0" encoding="UTF-8"?>
<SOAP-ENV:Envelope xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/" xmlns:ns1="http://tempuri.org/">
    <SOAP-ENV:Body>
        <ns1:MakeToken>
            <ns1:amount>20000</ns1:amount>
<ns1:merchantId>BB00</ns1:merchantId>
<ns1:invoiceNo>1</ns1:invoiceNo>
<ns1:revertURL>BB00</ns1:revertURL>
        </ns1:MakeToken>
    </SOAP-ENV:Body>
</SOAP-ENV:Envelope>